apache/nuttx/arch/arm/include/imxrt/imxrt106x_irq.h
#ifdef CONFIG_IMXRT_GPIO7_16_31_IRQ
#  define IMXRT_IRQ_GPIO7_16   (_IMXRT_GPIO7_16_31_BASE + 0)  /* GPIO7 pin 16 interrupt */
#  define IMXRT_IRQ_GPIO7_17   (_IMXRT_GPIO7_16_31_BASE + 1)  /* GPIO7 pin 17 interrupt */
#  define IMXRT_IRQ_GPIO7_18   (_IMXRT_GPIO7_16_31_BASE + 2)  /* GPIO7 pin 18 interrupt */
#  define IMXRT_IRQ_GPIO7_19   (_IMXRT_GPIO7_16_31_BASE + 3)  /* GPIO7 pin 19 interrupt */
#  define IMXRT_IRQ_GPIO7_20   (_IMXRT_GPIO7_16_31_BASE + 4)  /* GPIO7 pin 20 interrupt */
#  define IMXRT_IRQ_GPIO7_21   (_IMXRT_GPIO7_16_31_BASE + 5)  /* GPIO7 pin 21 interrupt */
#  define IMXRT_IRQ_GPIO7_22   (_IMXRT_GPIO7_16_31_BASE + 6)  /* GPIO7 pin 22 interrupt */
#  define IMXRT_IRQ_GPIO7_23   (_IMXRT_GPIO7_16_31_BASE + 7)  /* GPIO7 pin 23 interrupt */
#  define IMXRT_IRQ_GPIO7_24   (_IMXRT_GPIO7_16_31_BASE + 8)  /* GPIO7 pin 24 interrupt */
#  define IMXRT_IRQ_GPIO7_25   (_IMXRT_GPIO7_16_31_BASE + 9)  /* GPIO7 pin 25 interrupt */
#  define IMXRT_IRQ_GPIO7_26   (_IMXRT_GPIO7_16_31_BASE + 10) /* GPIO7 pin 26 interrupt */
#  define IMXRT_IRQ_GPIO7_27   (_IMXRT_GPIO7_16_31_BASE + 11) /* GPIO7 pin 27 interrupt */
#  define IMXRT_IRQ_GPIO7_28   (_IMXRT_GPIO7_16_31_BASE + 12) /* GPIO7 pin 28 interrupt */
#  define IMXRT_IRQ_GPIO7_29   (_IMXRT_GPIO7_16_31_BASE + 13) /* GPIO7 pin 29 interrupt */
#  define IMXRT_IRQ_GPIO7_30   (_IMXRT_GPIO7_16_31_BASE + 14) /* GPIO7 pin 30 interrupt */
#  define IMXRT_IRQ_GPIO7_31   (_IMXRT_GPIO7_16_31_BASE + 15) /* GPIO7 pin 31 interrupt */

#  define _IMXRT_GPIO7_16_31_NIRQS 16
#  define _IMXRT_GPIO8_0_15_BASE (_IMXRT_GPIO7_16_31_BASE + _IMXRT_GPIO7_16_31_NIRQS)
#  define IMXRT_GPIO7_NIRQS    (_IMXRT_GPIO7_0_15_NIRQS + _IMXRT_GPIO7_16_31_NIRQS)
#else
#  define _IMXRT_GPIO8_0_15_BASE _IMXRT_GPIO7_16_31_BASE
#  define IMXRT_GPIO7_NIRQS    _IMXRT_GPIO7_0_15_NIRQS
#endif

#ifdef CONFIG_IMXRT_GPIO8_0_15_IRQ
#  define IMXRT_IRQ_GPIO8_0    (_IMXRT_GPIO8_0_15_BASE + 0)   /* GPIO8 pin 0 interrupt */
#  define IMXRT_IRQ_GPIO8_1    (_IMXRT_GPIO8_0_15_BASE + 1)   /* GPIO8 pin 1 interrupt */
#  define IMXRT_IRQ_GPIO8_2    (_IMXRT_GPIO8_0_15_BASE + 2)   /* GPIO8 pin 2 interrupt */
#  define IMXRT_IRQ_GPIO8_3    (_IMXRT_GPIO8_0_15_BASE + 3)   /* GPIO8 pin 3 interrupt */
#  define IMXRT_IRQ_GPIO8_4    (_IMXRT_GPIO8_0_15_BASE + 4)   /* GPIO8 pin 4 interrupt */
#  define IMXRT_IRQ_GPIO8_5    (_IMXRT_GPIO8_0_15_BASE + 5)   /* GPIO8 pin 5 interrupt */
#  define IMXRT_IRQ_GPIO8_6    (_IMXRT_GPIO8_0_15_BASE + 6)   /* GPIO8 pin 6 interrupt */
#  define IMXRT_IRQ_GPIO8_7    (_IMXRT_GPIO8_0_15_BASE + 7)   /* GPIO8 pin 7 interrupt */
#  define IMXRT_IRQ_GPIO8_8    (_IMXRT_GPIO8_0_15_BASE + 8)   /* GPIO8 pin 8 interrupt */
#  define IMXRT_IRQ_GPIO8_9    (_IMXRT_GPIO8_0_15_BASE + 9)   /* GPIO8 pin 9 interrupt */
#  define IMXRT_IRQ_GPIO8_10   (_IMXRT_GPIO8_0_15_BASE + 10)  /* GPIO8 pin 10 interrupt */
#  define IMXRT_IRQ_GPIO8_11   (_IMXRT_GPIO8_0_15_BASE + 11)  /* GPIO8 pin 11 interrupt */
#  define IMXRT_IRQ_GPIO8_12   (_IMXRT_GPIO8_0_15_BASE + 12)  /* GPIO8 pin 12 interrupt */
#  define IMXRT_IRQ_GPIO8_13   (_IMXRT_GPIO8_0_15_BASE + 13)  /* GPIO8 pin 13 interrupt */
#  define IMXRT_IRQ_GPIO8_14   (_IMXRT_GPIO8_0_15_BASE + 14)  /* GPIO8 pin 14 interrupt */
#  define IMXRT_IRQ_GPIO8_15   (_IMXRT_GPIO8_0_15_BASE + 15)  /* GPIO8 pin 15 interrupt */

#  define _IMXRT_GPIO8_0_15_NIRQS 16
#  define _IMXRT_GPIO8_16_31_BASE (_IMXRT_GPIO8_0_15_BASE + _IMXRT_GPIO8_0_15_NIRQS)
#else
#  define _IMXRT_GPIO8_0_15_NIRQS 0
#  define _IMXRT_GPIO8_16_31_BASE _IMXRT_GPIO8_0_15_BASE
#endif

#ifdef CONFIG_IMXRT_GPIO8_16_31_IRQ
#  define IMXRT_IRQ_GPIO8_16   (_IMXRT_GPIO8_16_31_BASE + 0)  /* GPIO8 pin 16 interrupt */
#  define IMXRT_IRQ_GPIO8_17   (_IMXRT_GPIO8_16_31_BASE + 1)  /* GPIO8 pin 17 interrupt */
#  define IMXRT_IRQ_GPIO8_18   (_IMXRT_GPIO8_16_31_BASE + 2)  /* GPIO8 pin 18 interrupt */
#  define IMXRT_IRQ_GPIO8_19   (_IMXRT_GPIO8_16_31_BASE + 3)  /* GPIO8 pin 19 interrupt */
#  define IMXRT_IRQ_GPIO8_20   (_IMXRT_GPIO8_16_31_BASE + 4)  /* GPIO8 pin 20 interrupt */
#  define IMXRT_IRQ_GPIO8_21   (_IMXRT_GPIO8_16_31_BASE + 5)  /* GPIO8 pin 21 interrupt */
#  define IMXRT_IRQ_GPIO8_22   (_IMXRT_GPIO8_16_31_BASE + 6)  /* GPIO8 pin 22 interrupt */
#  define IMXRT_IRQ_GPIO8_23   (_IMXRT_GPIO8_16_31_BASE + 7)  /* GPIO8 pin 23 interrupt */
#  define IMXRT_IRQ_GPIO8_24   (_IMXRT_GPIO8_16_31_BASE + 8)  /* GPIO8 pin 24 interrupt */
#  define IMXRT_IRQ_GPIO8_25   (_IMXRT_GPIO8_16_31_BASE + 9)  /* GPIO8 pin 25 interrupt */
#  define IMXRT_IRQ_GPIO8_26   (_IMXRT_GPIO8_16_31_BASE + 10) /* GPIO8 pin 26 interrupt */
#  define IMXRT_IRQ_GPIO8_27   (_IMXRT_GPIO8_16_31_BASE + 11) /* GPIO8 pin 27 interrupt */
#  define IMXRT_IRQ_GPIO8_28   (_IMXRT_GPIO8_16_31_BASE + 12) /* GPIO8 pin 28 interrupt */
#  define IMXRT_IRQ_GPIO8_29   (_IMXRT_GPIO8_16_31_BASE + 13) /* GPIO8 pin 29 interrupt */
#  define IMXRT_IRQ_GPIO8_30   (_IMXRT_GPIO8_16_31_BASE + 14) /* GPIO8 pin 30 interrupt */
#  define IMXRT_IRQ_GPIO8_31   (_IMXRT_GPIO8_16_31_BASE + 15) /* GPIO8 pin 31 interrupt */

#  define _IMXRT_GPIO8_16_31_NIRQS 16
#  define _IMXRT_GPIO9_0_15_BASE (_IMXRT_GPIO8_16_31_BASE + _IMXRT_GPIO8_16_31_NIRQS)
#  define IMXRT_GPIO8_NIRQS    (_IMXRT_GPIO8_0_15_NIRQS + _IMXRT_GPIO8_16_31_NIRQS)
#else
#  define _IMXRT_GPIO9_0_15_BASE _IMXRT_GPIO8_16_31_BASE
#  define IMXRT_GPIO8_NIRQS    _IMXRT_GPIO8_0_15_NIRQS
#endif

#ifdef CONFIG_IMXRT_GPIO9_0_15_IRQ
#  define IMXRT_IRQ_GPIO9_0    (_IMXRT_GPIO9_0_15_BASE + 0)   /* GPIO9 pin 0 interrupt */
#  define IMXRT_IRQ_GPIO9_1    (_IMXRT_GPIO9_0_15_BASE + 1)   /* GPIO9 pin 1 interrupt */
#  define IMXRT_IRQ_GPIO9_2    (_IMXRT_GPIO9_0_15_BASE + 2)   /* GPIO9 pin 2 interrupt */
#  define IMXRT_IRQ_GPIO9_3    (_IMXRT_GPIO9_0_15_BASE + 3)   /* GPIO9 pin 3 interrupt */
#  define IMXRT_IRQ_GPIO9_4    (_IMXRT_GPIO9_0_15_BASE + 4)   /* GPIO9 pin 4 interrupt */
#  define IMXRT_IRQ_GPIO9_5    (_IMXRT_GPIO9_0_15_BASE + 5)   /* GPIO9 pin 5 interrupt */
#  define IMXRT_IRQ_GPIO9_6    (_IMXRT_GPIO9_0_15_BASE + 6)   /* GPIO9 pin 6 interrupt */
#  define IMXRT_IRQ_GPIO9_7    (_IMXRT_GPIO9_0_15_BASE + 7)   /* GPIO9 pin 7 interrupt */
#  define IMXRT_IRQ_GPIO9_8    (_IMXRT_GPIO9_0_15_BASE + 8)   /* GPIO9 pin 8 interrupt */
#  define IMXRT_IRQ_GPIO9_9    (_IMXRT_GPIO9_0_15_BASE + 9)   /* GPIO9 pin 9 interrupt */
#  define IMXRT_IRQ_GPIO9_10   (_IMXRT_GPIO9_0_15_BASE + 10)  /* GPIO9 pin 10 interrupt */
#  define IMXRT_IRQ_GPIO9_11   (_IMXRT_GPIO9_0_15_BASE + 11)  /* GPIO9 pin 11 interrupt */
#  define IMXRT_IRQ_GPIO9_12   (_IMXRT_GPIO9_0_15_BASE + 12)  /* GPIO9 pin 12 interrupt */
#  define IMXRT_IRQ_GPIO9_13   (_IMXRT_GPIO9_0_15_BASE + 13)  /* GPIO9 pin 13 interrupt */
#  define IMXRT_IRQ_GPIO9_14   (_IMXRT_GPIO9_0_15_BASE + 14)  /* GPIO9 pin 14 interrupt */
#  define IMXRT_IRQ_GPIO9_15   (_IMXRT_GPIO9_0_15_BASE + 15)  /* GPIO9 pin 15 interrupt */

#  define _IMXRT_GPIO9_0_15_NIRQS 16
#  define _IMXRT_GPIO9_16_31_BASE (_IMXRT_GPIO9_0_15_BASE + _IMXRT_GPIO9_0_15_NIRQS)
#else
#  define _IMXRT_GPIO9_0_15_NIRQS 0
#  define _IMXRT_GPIO9_16_31_BASE _IMXRT_GPIO9_0_15_BASE
#endif

#ifdef CONFIG_IMXRT_GPIO9_16_31_IRQ
#  define IMXRT_IRQ_GPIO9_16   (_IMXRT_GPIO9_16_31_BASE + 0)  /* GPIO9 pin 16 interrupt */
#  define IMXRT_IRQ_GPIO9_17   (_IMXRT_GPIO9_16_31_BASE + 1)  /* GPIO9 pin 17 interrupt */
#  define IMXRT_IRQ_GPIO9_18   (_IMXRT_GPIO9_16_31_BASE + 2)  /* GPIO9 pin 18 interrupt */
#  define IMXRT_IRQ_GPIO9_19   (_IMXRT_GPIO9_16_31_BASE + 3)  /* GPIO9 pin 19 interrupt */
#  define IMXRT_IRQ_GPIO9_20   (_IMXRT_GPIO9_16_31_BASE + 4)  /* GPIO9 pin 20 interrupt */
#  define IMXRT_IRQ_GPIO9_21   (_IMXRT_GPIO9_16_31_BASE + 5)  /* GPIO9 pin 21 interrupt */
#  define IMXRT_IRQ_GPIO9_22   (_IMXRT_GPIO9_16_31_BASE + 6)  /* GPIO9 pin 22 interrupt */
#  define IMXRT_IRQ_GPIO9_23   (_IMXRT_GPIO9_16_31_BASE + 7)  /* GPIO9 pin 23 interrupt */
#  define IMXRT_IRQ_GPIO9_24   (_IMXRT_GPIO9_16_31_BASE + 8)  /* GPIO9 pin 24 interrupt */
#  define IMXRT_IRQ_GPIO9_25   (_IMXRT_GPIO9_16_31_BASE + 9)  /* GPIO9 pin 25 interrupt */
#  define IMXRT_IRQ_GPIO9_26   (_IMXRT_GPIO9_16_31_BASE + 10) /* GPIO9 pin 26 interrupt */
#  define IMXRT_IRQ_GPIO9_27   (_IMXRT_GPIO9_16_31_BASE + 11) /* GPIO9 pin 27 interrupt */
#  define IMXRT_IRQ_GPIO9_28   (_IMXRT_GPIO9_16_31_BASE + 12) /* GPIO9 pin 28 interrupt */
#  define IMXRT_IRQ_GPIO9_29   (_IMXRT_GPIO9_16_31_BASE + 13) /* GPIO9 pin 29 interrupt */
#  define IMXRT_IRQ_GPIO9_30   (_IMXRT_GPIO9_16_31_BASE + 14) /* GPIO9 pin 30 interrupt */
#  define IMXRT_IRQ_GPIO9_31   (_IMXRT_GPIO9_16_31_BASE + 15) /* GPIO9 pin 31 interrupt */

#  define _IMXRT_GPIO9_16_31_NIRQS 16
#  define IMXRT_GPIO9_NIRQS    (_IMXRT_GPIO9_0_15_NIRQS + _IMXRT_GPIO9_16_31_NIRQS)
#else
#  define IMXRT_GPIO9_NIRQS    _IMXRT_GPIO9_0_15_NIRQS
#endif

#define IMXRT_GPIO_NIRQS       (IMXRT_GPIO1_NIRQS + IMXRT_GPIO2_NIRQS + \
                                IMXRT_GPIO3_NIRQS + IMXRT_GPIO4_NIRQS + \
                                IMXRT_GPIO5_NIRQS + IMXRT_GPIO6_NIRQS + \
                                IMXRT_GPIO7_NIRQS + IMXRT_GPIO9_NIRQS + \
                                IMXRT_GPIO9_NIRQS )
#define IMXRT_GPIO_IRQ_LAST    (_IMXRT_GPIO1_0_15_BASE + IMXRT_GPIO_NIRQS)

/* Total number of IRQ numbers **********************************************************/

#define NR_IRQS                (IMXRT_IRQ_EXTINT + IMXRT_IRQ_NEXTINT + IMXRT_GPIO_NIRQS)

/****************************************************************************************
 * Public Types
 ****************************************************************************************/

/****************************************************************************************
 * Inline functions
 ****************************************************************************************/

/****************************************************************************************
 * Public Data
 ****************************************************************************************/

/****************************************************************************************
 * Public Function Prototypes
 ****************************************************************************************/

#ifndef __ASSEMBLY__
#ifdef __cplusplus
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

#undef EXTERN
#ifdef __cplusplus
}
#endif
#endif

#endif /* __ARCH_ARM_INCLUDE_IMXRT_IMXRT106X_IRQ_H */
